app/views/pages/armarmenu.html.erb


<% fechaLiminte =  @user.plancliente.last.updated_at + @user.plancliente.last.service.limite.days %>
---
SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 5 LIMIT 1