app/controllers/pages_controller.rb

  def micuenta




    if session[:login].nil?


      @message = false

      if request.post?
        @usuario = Customers.where('email = ? and password = ?', params[:email], params[:clave])

        if @usuario.count == 0
---
SELECT `customers`.* FROM `customers`  WHERE (email = 'danielpunk4@gmail.com' and password = 'danielpunk4@gmail.com')
SELECT COUNT(*) FROM `customers`  WHERE (email = 'danielpunk4@gmail.com' and password = 'danielpunk4@gmail.com')

  def armarmenu



    if session[:login].nil?
      redirect_to home_path
    else

      @plancliente = Plancliente.find_by_customers_id(session[:login])
      @user = Customers.find_by_id(session[:login])
      @armar = true;



      if @user.plancliente.last.service_id == 5

        @plan = Service.find_by_id(5)
---
SELECT  `planclientes`.* FROM `planclientes`  WHERE `planclientes`.`customers_id` = 1  ORDER BY `planclientes`.`id` DESC LIMIT 1
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 5 LIMIT 1




      @menuscliente = Menucliente.where('usuario_id= ?', session[:login])
---
SELECT  `menuclientes`.* FROM `menuclientes`  WHERE (usuario_id= 1)  ORDER BY `menuclientes`.`id` ASC LIMIT 1

  def quehacemos
    @textsGenerals  = Text.all
---
SELECT `texts`.* FROM `texts`

  def estilodevida
    @textsGenerals  = Text.all
---
SELECT `texts`.* FROM `texts`